

# Parameters
nc: 1000 # number of classes

# ResNet18 backbone
backbone:
# [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock_Star, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BasicBlock_Star, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock_ELA_STAR, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock_ELA_STAR, 2, 5, 'relu']] # 7-P5/32

# YOLO11n head
head:
  - [ 7, 1, Conv, [ 256, 1, 1 ] ]     # proj P5
  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]
  - [ 6, 1, Conv, [ 256, 1, 1 ] ]     # proj P4
  - [ [ -2, -1 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, RepC3, [ 256, 0.5 ] ]

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]
  - [ 5, 1, Conv, [ 256, 1, 1 ] ]     # proj P3
  - [ [ -2, -1 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, RepC3, [ 256, 0.5 ] ]

  - [-1, 1, Classify, [nc]] # Classify
